Repository: mlforcada/llibre-tecnol-trad
Catalog: llibrett/omegat/tm/memtrad-tecnicasTA-usosTA.tmx
Source language: ca
Languages: es_es

source: Candide usa mètodes estadístics per a l'anàlisi i la generació, però cap regla lingüística.
es_es: Candide utiliza métodos estadísticos para el análisis y la generación, pero ninguna regla lingüística.

source: Cap sistema real de traducció automàtica usa aquest model tan rudimentari de traducció, ja que és incapaç de produir traduccions automàtiques útils, ni tan sols per a llengües molt similars: tots els sistemes van més enllà i realitzen operacions addicionals.
es_es: Ningún sistema real de traducción automática usa este modelo tan rudimentario de traducción, puesto que es incapaz de producir traducciones automáticas útiles, ni siquiera para lenguas muy similares: todos los sistemas van más allá y realizan operaciones adicionales.

source: Com a exemple, descriurem un tipus bastant estés d'analitzador ascendent, anomenat usualment GLR (generalized LR o LR generalitzat, on LR és l'abreviació de left-to-right, rightmost derivation, ``d'esquerra a dreta i amb derivació per la dreta'').
es_es: Como ejemplo, describiremos un tipo bastante extendido de analizador ascendente, llamado usualmente GLR (generalized LR o LR generalizado, donde LR es la abreviación de left-to-right, rightmost derivation, ``de izquierda a derecha y con derivación por la derecha'').

source: Com a màxim, podem dir que el lema comença per { ang}.
es_es: Como mucho, podemos decir que el lema comienza por { ang}.

source: Com a producte, una traducció es pot identificar com a tal perquè és un document (en LM) derivat d'un altre document en un altre idioma (LO), i que manté una certa similitud de contingut amb aquest.
es_es: Como producto, una traducción se puede identificar como tal porque es un documento (en LM) derivado de otro documento en otro idioma (LO), y que mantiene una cierta similitud de contenido con este.

source: Com en el cas dels traductors professionals, els sistemes de traducció automàtica no sempre necessiten comprendre les frases en llengua origen (LO) , és a dir, construir-ne una interpretació explícita.
es_es: Como en el caso de los traductores profesionales, los sistemas de traducción automática no siempre necesitan comprender las frases en lengua origen (LO), es decir, construir una interpretación explícita.

source: Com en els exemples, en maori la majoria dels noms i adjectius són invariables.
es_es: Como en los ejemplos, en maorí la mayoría de los nombres y adjetivos son invariables.

source: Com era el sistema abans de l'addició de la nova llengua?
es_es: ¿Cómo era el sistema antes de la adición de la nueva lengua?

source: Com es pot veure, les regles de reordenament intenten descobrir unitats sintàctiques (sintagmes) usant un nombre limitat de patrons que representen les seqüències de mots que poden formar aquestes unitats; el problema és que els sintagmes poden ser, en principi, indefinidament llargs, i el conjunt de regles de reordenament ha de ser forçosament limitat.
es_es: Como se puede observar, las reglas de reordenamiento intentan descubrir unidades sintácticas (sintagmas) usando un número limitado de patrones que representan las secuencias de palabras que pueden formar estas unidades; el problema es que los sintagmas pueden ser, en principio, indefinidamente largos, y el conjunto de reglas de reordenamiento tiene que ser forzosamente limitado.

source: Com molts altres substantius acabats en -ció
es_es: Como otros muchos sustantivos acabados en -ción

source: Com més llargs siguen els segments, menys segments s'usaran i més context tindran; i a l'inrevés, com més curts siguen els segments més segments faran falta per produir la hipòtesi de traducció.
es_es: Cuanto más largos sean los segmentos, menos segmentos se usarán y más contexto tendrán; y al revés, cuanto más cortos sean los segmentos más segmentos harán falta para producir la hipótesis de traducción.

source: Com més profunda és l'anàlisi en un sistema de traducció automàtica{} {}més complexa és la transferència.
es_es: Cuanto más profundo es el análisis en un sistema de traducción automática{} {}más compleja es la transferencia.

source: Com podria fer l'elecció adequada un sistema de traducció automàtica?
es_es: ¿Cómo podria hacer la elección adecuada un sistema de traducción automática?

source: Com que els sistemes de transferència morfològica avançada no identifiquen realment les relacions sintàctiques entre els mots de la frase en la llengua d'origen, per a fer els reordenaments han d'identificar les seqüències de mots que necessiten ser reordenats.
es_es: Como los sistemas de transferencia morfológica avanzada no identifican realmente las relaciones sintácticas entre las palabras de la frase en la lengua de origen, para hacer los reordenamientos tienen que identificar las secuencias de palabras que necesitan ser reordenadas.

source: Com que l'objectiu de l'equip que dissenya els diccionaris és que tinguen la cobertura més alta possible (és a dir, que deixen el mínim possible de mots sense traduir), l'única estratègia raonable és la d'ordenar els mots de la llengua original per freqüències d'aparició i anar introduint-los en el diccionari en aquest ordre, de manera que en cada moment sempre estem augmentant la cobertura del diccionari tan ràpidament com és possible.
es_es: Como el objetivo del equipo que diseña los diccionarios es que tengan la cobertura más alta posible (es decir, que dejen el mínimo posible de palabras sin traducir), la única estrategia razonable es la de ordenar las palabras de la lengua original por frecuencias de aparición e ir introduciéndolas en el diccionario en este orden, de forma que en cada momento siempre estemos aumentando la cobertura del diccionario tan rápidamente cómo es posible.

source: Com que una vegada identificada la classe de sintagma queda clar que el nucli és el primer element (el substantiu), ja es pot propagar el gènere i el nombre del primer element al segon (l'adjectiu): (es) subst adj \(\) (ca) subst adj
es_es: Una vez identificada la clase de sintagma queda claro que el núcleo es el primer elemento (el sustantivo), ya se puede propagar el género y el número del primer elemento al segundo (el adjetivo): (es) sust adj \(\) (ca) sust adj

source: Consulteu el llibre de {koehnbook} per saber més sobre els models que s'usen per a traduir, el procés de tuning i les mesures automàtiques de la qualitat que usen.
es_es: Consultáis el libro de {koehnbook} para saber más sobre los modelos que se usan para traducir, el proceso de tuning y las medidas automáticas de la calidad que usan.

source: Convé adoptar-lo i contractar el corrector o és millor contractar el traductor professional?
es_es: ¿Conviene adoptarlo y contratar al corrector o es mejor contratar el traductor profesional?

source: D'una altra part, els sistemes de traducció automàtica indirecta per transferència (que es discutiran en l'apartat ) són el resultat d'una sèrie d'aproximacions (moltes d'elles inevitables) sobre un model ideal i teòricament motivat basat en el principi de composicionalitat semàntica.
es_es: Por otro lado, los sistemas de traducción automática indirecta por transferencia (que se discutirán en el apartado ) son el resultado de una serie de aproximaciones (muchas de ellas inevitables) sobre un modelo ideal y teóricamente motivado basado en el principio de composicionalidad semántica.

source: De fet, actualment, la postedició no s'encarrega sempre a traductors (molts dels quals no no consideren açò com a part del seu treball), sinó a persones que es presumeix preparades específicament.
es_es: De hecho, actualmente, la postedición no se encarga siempre a traductores (muchos de los cuales no consideran esto como parte de su trabajo), sino a personas que se sospecha que están preparadas específicamente.

source: De fet, com ja s'ha dit, els sintagmes tenen estructura; és a dir, les relacions entre els elements d'un sintagma no són purament lineals, sinó jeràrquiques: els sintagmes estan fets de sintagmes.
es_es: De hecho, como ya se ha dicho, los sintagmas tienen estructura; es decir, las relaciones entre los elementos de un sintagma no son puramente lineales, sino jerárquicas: los sintagmas están hechos de sintagmas.

source: De fet, els sistemes de transferència morfològica avançada es poden veure com el resultat de fer una tercera aproximació, afegida a les dues (aproximació oracional i aproximació de transferència) discutides en l'apartat : Aproximació de transferència parcial: Quan les llengües involucrades no són massa diferents sintàcticament (per exemple, quan estan emparentades), no cal fer l'anàlisi sintàctica completa: la transferència lèxica és completa però la transferència estructural és parcial i local i només es fa on és necessària.
es_es: De hecho, los sistemas de transferencia morfológica avanzada se pueden ver como el resultado de hacer una tercera aproximación, añadida a las dos (aproximación oracional y aproximación de transferencia) discutidas en el apartado : Aproximación de transferencia parcial: Cuando las lenguas involucradas no son demasiado diferentes sintácticamente (por ejemplo, cuando están emparentadas), no hay que hacer el análisis sintáctico completo: la transferencia léxica es completa pero la transferencia estructural es parcial y local y sólo se hace donde es necesaria.

source: De fet, hom podria dissenyar els sistemes de traducció automàtica perquè no es preocuparen d'aquests assumptes menors.
es_es: De hecho, podrían diseñar los sistemas de traducción automática para que no se preocuparan por estos asuntos menores.

source: De fet, si ordenem els mots d'un gran corpus de text real (de qualsevol tipus i de qualsevol idioma) pel nombre de vegades que hi apareixen, començant pel més freqüent, el nombre d'aparicions es redueix dramàticament segons que anem baixant per la llista.
es_es: De hecho, si ordenamos las palabras de un gran corpus de texto real (de cualquier tipo y de cualquier idioma) por el número de veces que aparecen, empezando por la más frecuente, el número de apariciones se reduce dramáticamente según vayamos bajando por la lista.

source: De fet, és típic que la majoria dels mots siguen hapax legomena, és a dir, mots que han aparegut només una vegada en tot el corpus.
es_es: De hecho, es típico que la mayoría de las palabras sean hapax legomena, es decir, palabras que han aparecido sólo una vez en todo el corpus.

source: De vegades l'anàlisi morfològica pot ser més difícil del que sembla, com per exemple, en el cas de la morfologia verbal de les llengües romàniques.
es_es: A veces el análisis morfológico puede parecer más difícil de lo que parece, como por ejemplo, en el caso de la morfología verbal de las lenguas románicas.

source: Deixeu de banda la concordança i centreu-vos només en els reordenaments.
es_es: Dejad a un lado la concordancia y centraos sólo en los reordenamientos.

source: Dels-boxadors els noms apuntat els-havia.} que és molt més difícil de llegir que el resultat de traduir el text en tok pisin mot per mot.
es_es: Dels-boxadors els noms apuntat els-havia.} que es mucho más difícil de leer que el resultado de traducir el texto en tok pisin palabra por palabra.

source: Depenent del tipus concret de sistema de traducció automàtica per transferència, encara són possibles més aproximacions, com veurem més avall.
es_es: Dependiendo del tipo concreto de sistema de traducción automática por transferencia, todavía son posibles más aproximaciones, como podremos ver más abajo.

source: Des de l'informe ALPAC el camp va patir una redefinició progressiva vers una concepció de la TA com un procés en el qual els traductors humans juguen un paper bàsic, i comencen a desenvolupar-se eines de traducció pensant en aquesta intervenció.
es_es: Desde el informe ALPAC el campo sufrió una redefinición progresiva hacia una concepción de la TA como un proceso en el que los traductores humanos juegan un papel básico y empiezan a desarrollarse herramientas de traducción pensando en esta intervención.

source: Des dels seus inicis, quasi tota la recerca i quasi tots els sistemes comercials de TA s'han centrat en els principals idiomes internacionals: anglés, francés, espanyol, japonés, rus, etc.
es_es: Desde sus inicios, casi toda la investigación y casi todos los sistemas comerciales de TA se han centrado en los principales idiomas internacionales: inglés, francés, español, japonés, ruso, etc.

source: Després, el sistema continua traduint mot per mot.
es_es: Después, el sistema continúa traduciendo palabra por palabra.

source: Després, per als idiomes elegits, doneu un exemple de traducció mot a mot inacceptable en tres d'aquests cinc casos: homografia mal resolta d'un mot polisèmia mal resolta d'un mot problemes de concordança ambigüitat estructural mal resolta problemes amb l'ordre dels mots
es_es: Después, para los idiomas elegidos, dáis un ejemplo de traducción palabra a palabra inaceptable en tres de estos cinco casos: homografía mal resuelta de una palabra polisemia mal resuelta de una palabra problemas de concordancia ambigüedad estructural mal resuelta problemas con el orden de las palabras

source: Dues regles són suficients (la resta va bé mot per mot):
es_es: Dos reglas son suficientes (el resto va bien palabra por palabra):

source: Durant aquest decenni els esforços es dirigeixen vers la traducció indirecta amb representacions intermèdies o sense (com la interlingua; vegeu l'apartat ) mitjançant anàlisis morfològiques i sintàctiques i, de vegades, coneixements semàntics.
es_es: Durante esta década los esfuerzos se dirigen a través la traducción indirecta con representaciones intermedias o sin (como la interlingua; véase el apartado ) mediante análisis morfológicos y sintácticos y, a veces, conocimientos semánticos.

source: Durant el decenni de 2010 s'està investigant en sistemes que usen l'anomenat aprenentatge profund (en anglés deep learning) basat en xarxes neurals artificials, les quals es basen vagament en com funciona el cervell humà.
es_es: Durante el decenio de 2010 se investigó en sistemas que usan el llamado aprendizaje profundo (en inglés deep learning) basado en redes neurales artificiales, las cuales se basan vagamente en cómo funciona el cerebro humano.

source: El 1952 es va celebrar als Estats Units el primer congrés sobre TA on es van definir les línies fonamentals a seguir.
es_es: En el año 1952 se celebró en los Estados Unidos el primer congreso sobre TA en el que se definieron las líneas fundamentales a seguir.

source: El model de traducció s'aprén a partir d'un corpus paral·lel amb les oracions ja alineades com el que es mostra en la figura .
es_es: El modelo de traducción se aprende a partir de un corpus paralelo con las oraciones ya alineadas como el que se muestra en la figura .

source: El principi de composicionalitat semàntica postula que la interpretació d'una oració es construeix combinant les interpretacions dels mots seguint precisament les agrupacions successives (constituents) que indica l'arbre d'anàlisi sintàctica de l'oració, partint dels mots i anant cap a l'arrel de l'arbre.
es_es: El principio de composicionalidad semántica postula que la interpretación de una oración se construye combinando las interpretaciones de las palabras siguiendo precisamente las agrupaciones sucesivas (constituyentes) que indica el árbol de análisis sintáctico de la oración, partiendo de las palabras y yendo hacia la raíz del árbol.

source: El Dr.John Hutchins és considerat l'historiador de la traducció automàtica, i fins fa poc mantenia activament l'arxiu {www.mt-archive.info}, on es poden trobar reproduccions facsímils de molts articles dels inicis d'aquesta disciplina.
es_es: El Dr.John Hutchins es considerado el historiador de la traducción automática, y hasta hace poco mantenía el archivo en activo {www.mt-archive.info}, donde se pueden encontrar reproducciones facsímiles de muchos articulos de los inicios de esta disciplina.

source: El GDA d'un analitzador morfològic té un vèrtex inicial únic (indicat amb una fletxa que no ve de cap lloc i del qual només poden eixir fletxes) que representa l'estat inicial de l'analitzador abans de començar a llegir un mot.
es_es: El GDA de un analizador morfológico tiene un vértice inicial único (indicado con una flecha que no viene de ningún lugar y del cual sólo puede salir flechas) que representa el estado inicial del analizador antes de empezar a leer una palabra.

source: El ``control'' dels llenguatges controlats{} {} es refereix tant a la terminologia com a la sintaxi.
es_es: El ``control'' de los lenguajes controlados{} {} se refiere tanto a la terminología como a la sintaxis.

source: El capítol es centra en la avaluació dels sistemes de traducció automàtica i l'anàlisi de costos de traducció; en aquest apartat discutirem les diferents tasques i opcions per automatitzar el procés de traducció.
es_es: El capítulo se centra en la evaluación de los sistemas de traducción automática y el análisis de costes de traducción; en este apartado discutiremos las diferentes tareas y opciones para automatizar el proceso de traducción.

source: El graf és acíclic si, seguint les fletxes, no es pot passar dues voltes pel mateix vèrtex.
es_es: El grafo es acíclico si, siguiendo las flechas, no se puede pasar dos veces por el mismo vértice.

source: El gruix de les línies que connecten les paraules representa la probabilitat de l'alineament.}
es_es: El grueso de las líneas que conectan las palabras representa la probabilidad del alineamiento.}

source: El llatí clàssic no, perquè a pesar de ser l'origen de totes les llengües del sistema té una sintaxi ---verb final--- i morfologia --declinació--- molt diferents; la llengua artificial anomenada interlingua ---``le lingua international facile e de aspecto natural elaborate per linguistas professional como denominator commun del linguas le plus diffundite in le mundo''.}--- amb anotacions sintàctiques i marques de desambiguació podria ser una millor opció.
es_es: El latín clásico no porque, a pesar de ser el origen de todas las lenguas del sistema, tiene una sintaxis ---verbo final--- y morfología --declinación--- muy diferentes; la lengua artificial llamada interlingua ---``le lingua international facile e de aspecto natural elaborate por linguistas profesional como denominator commun del linguas le plus diffundite in le mundo''.}--- con anotaciones sintácticas y marcas de desambiguación podría ser una mejor opción.

source: El motiu és que el model de traducció no té en compte l'ordre en què apareixen els segments traduïts en la LM, ni el context en què apareixen els segments en LO a l'hora de puntuar les seues possibles traduccions.
es_es: El motivo es que el modelo de traducción no tiene en cuenta el orden en el que aparecen los segmentos traducidos en la LM, ni el contexto en el que aparecen los segmentos en LO a la hora de puntuar sus posibles traducciones.

source: El mètode consisteix a alinear en primer lloc les frases, els grups de mots i els mots en els dos textos i calcular després la probabilitat que un mot del text origen corresponga a un o més mots del text meta amb el qual ha estat alineat.
es_es: El método consiste en alinear en primer lugar las frases, los grupos de palabras y las palabras en los dos textos y calcular después la probabilidad de que una palabra del texto origen corresponda a una o más palabras del texto meta con el que ha sido alineado.

source: El principals són els desenvolupats a ATR, CMU i el projecte Verbmobil.
es_es: Lo principales son los desarrollados en ATR, CMU y el proyecto Verbmobil.

source: El problema d'aquesta definició és la indefinició del concepte de fidelitat.
es_es: El problema de esta definición es la indefinición del concepto de fidelidad.

source: El procés comença assumint que, per a cada oració paral·lela, tots els mots de l'oració en LM poden ser traducció de cadascun dels mots de l'oració en LO, i per tant, els assigna la mateixa probabilitat.
es_es: El proceso empieza asumiendo que, para cada oración paralela, todas las palabras de la oración en LM pueden ser traducción de cada una de las palabras de la oración en LO y, por lo tanto, les asigna la misma probabilidad.

source: El programa de la Generalitat Valenciana SALT 4.0 tradueix textos de l'espanyol a la varietat valenciana del català i pregunta esporàdicament a la persona usuària quin equivalent és més adequat per a alguns mots ambigus difícils.
es_es: El programa de la Generalitat Valenciana SALT 4.0 traduce textos del español a la variedad valenciana del catalán y pregunta esporádicamente a la persona usuaria qué equivalente es más adecuado para algunas palabras ambiguas difíciles.

source: El programari que porten instal·lat les naus de la confederació galàctica inclou un programa que tradueix una de les llengües majoritàries del planeta Zkanagg, el tazkannwat, al català.
es_es: El software que llevan instalado las naves de la confederación galáctica incluye un programa que tarduce una de las lenguas mayoritárias del planeta Zkanagg, el tazkannwat, al catalán.

source: El projecte, que va ser abandonat el 1992, no va ser capaç d'entregar un sistema de TA funcional, però va estimular la investigació sobre tecnologies lingüístiques a tot Europa.
es_es: El proyecto, que se abandonó en el año 1992, no fue capaz de entregar un sistema de TA funcional, pero estimuló la investigación sobre tecnologías lingüísticas en toda Europa.

source: El reordenament i la concordança es poden combinar en la mateixa regla; per exemple, quan es tradueix de l'anglés al català la seqüència adjectiu--substantiu, la regla podria tenir aquesta forma: (en) adj subst \(\) (ca) subst adj
es_es: El reordenamiento y la concordancia se pueden combinar en la misma regla; por ejemplo, cuando se traduce del inglés al catalán la secuencia adjetivo--sustantivo, la regla podría tener esta forma: (en) adj sust \(\) (ca) sust adj

source: El resultat [secció 4.2]{hutchins92b}, de vegades erròniament anomenat traducció directa en vista de la seua simplicitat, és el que es podria esperar ``d'una persona que comptara únicament amb un diccionari bilingüe molt barat i amb un coneixement molt rudimentari de la gramàtica de la llengua meta'', amb ``errors freqüents de naturalesa lèxica en la traducció i estructures sintàctiques inadequades'' que reflecteixen ``les estructures pròpies de la llengua d'origen''.
es_es: El resultado [sección 4.2]{hutchins92b}, a veces erróneamente llamado traducción directa en vista de su simplicidad, es el que se podría esperar de ``una persona que únicamente contase con un diccionario bilingüe muy barato y con un conocimiento muy rudimentario de la gramática de la lengua meta" con ``errores frecuentes de la naturaleza léxica en la traducción y estructuras sintácticas inadecuadas" que reflejan ``las estructuras propias de una lengua de origen".

source: El resultat de la traducció automàtica és normalment un producte bastant diferent a la traducció professional, i en la majoria dels casos no es pot usar en el seu lloc tal com està; per això, el capítol està dedicat a analitzar les diverses modalitats d'interacció entre persones i màquines en traducció.
es_es: El resultado de la traducción automática es normalmente un producto bastante diferente a la traducción profesional, y en la mayoría de los casos no se puede usar en su lugar tal y como está; por eso, el capítulo está dedicado a analizar las diversas modalidades de interacción entre personas y máquinas de traducción.

source: El resultat final es mostra en la figura (.SN.
es_es: El resultado final se muestra en la figura (.SN.

source: El resultat és que el sintagma preposicional de Zkannag queda darrere del verb.
es_es: El resultado es que el sintagma preposicional de Zkannag queda detrás del verbo.
